<!DOCTYPE html>
<html lang="en" dir="rtl">
<head>
    <meta charset="utf-8">
    <title>الدخول إلى نظام التأهيل والإصلاح</title>
    <base href="<?php echo base_url(); ?>"/>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <link href="assets/css/app.css" rel="stylesheet" />
    <link href="assets/css/base.css" rel="stylesheet" />
    <link href="assets/css/login.css" rel="stylesheet" />
    <link rel="icon" sizes="32x32" href="favicon.ico">
</head>
<body class="rtl" data-spy="scroll" data-target="#secondary-nav" data-offset="55">
<form runat="server" id="formSchool">
    <div id="app" class="v-application v-application--is-rtl theme--light">
        <div class="v-application--wrap">
            <main>
                <div class="app-content login-contents">
                    <div class="content-wrapper">
                        <div id="page-content" class="page-content-login">
                            <div class="page--wrapper login-page--wrapper">
                                <div class="application-container">
                                    <div class="app-login">
                                        <div class="login-content">
                                            <div class="login-wrapper">
                                                <div class="moi-logo">
                                                    <div class="image">
                                                        <img src="assets/img/moi-logo-2.png" />
                                                    </div>
                                                </div>

                                                <div class="content">

                                                    <div class="top-text">
                                                        <h2><span>تسجيل الدخول</span>الدخول إلى نظام التأهيل والإصلاح</h2>
                                                    </div>

                                                    <div class="actions">
                                                        <a href="/Home" class="custom-btn yellow-bg">
                                                   <span class="icon">
                                                       <svg version="1.1" xmlns="" width="59" height="32" viewBox="0 0 59 32"> <title>sso_2</title> <path d="M14.935 0c0.892 1.704 1.319 3.65 1.402 5.556 0.127 2.874-1.378 6.157-3.38 8.157-2.091 2.091-5.2 3.38-8.157 3.38-1.744-0.004-3.392-0.407-4.861-1.121l0.066 0.029 14.929 16h13.154v-18.845zM26.609 27.938c-0.35 0.579-0.809 1.057-1.352 1.419l-0.016 0.010c-0.569 0.372-1.23 0.663-1.938 0.836l-0.044 0.009c-0.692 0.175-1.486 0.275-2.303 0.275-0.017 0-0.034-0-0.051-0h0.003q-2.429 0-4.206-0.935v-2.704c1.238 0.949 2.809 1.52 4.513 1.52 0.006 0 0.013 0 0.019-0h-0.001q3.314 0 3.314-2.214c0.001-0.018 0.001-0.040 0.001-0.062 0-0.372-0.106-0.72-0.289-1.014l0.005 0.008c-0.207-0.307-0.461-0.565-0.755-0.77l-0.009-0.006c-0.327-0.226-0.702-0.43-1.097-0.592l-0.040-0.014c-0.436-0.181-0.904-0.367-1.402-0.559-0.742-0.291-1.347-0.572-1.931-0.886l0.096 0.047c-0.506-0.265-0.941-0.582-1.323-0.953l0.001 0.001c-0.337-0.335-0.608-0.736-0.79-1.182l-0.009-0.024c-0.171-0.445-0.27-0.959-0.27-1.496 0-0.030 0-0.060 0.001-0.090l-0 0.004c-0-0.020-0.001-0.044-0.001-0.067 0-0.697 0.19-1.35 0.52-1.909l-0.010 0.018c0.347-0.577 0.801-1.054 1.338-1.419l0.016-0.010c0.553-0.376 1.195-0.674 1.884-0.858l0.044-0.010c0.663-0.185 1.425-0.292 2.211-0.292 0.008 0 0.016 0 0.024 0h-0.001q2.039 0 3.659 0.707v2.549q-1.737-1.139-3.997-1.137c-0.018-0-0.039-0-0.061-0-0.432 0-0.85 0.059-1.247 0.17l0.033-0.008c-0.371 0.102-0.696 0.257-0.985 0.46l0.010-0.007c-0.26 0.183-0.471 0.417-0.624 0.688l-0.005 0.010c-0.14 0.253-0.222 0.554-0.222 0.874 0 0.006 0 0.013 0 0.019v-0.001c-0.001 0.023-0.001 0.049-0.001 0.076 0 0.347 0.082 0.676 0.229 0.966l-0.006-0.012c0.166 0.295 0.385 0.541 0.646 0.733l0.006 0.004c0.302 0.221 0.646 0.417 1.012 0.571l0.033 0.012q0.617 0.255 1.402 0.568c0.766 0.29 1.384 0.566 1.983 0.873l-0.11-0.051c0.539 0.27 1.004 0.587 1.42 0.958l-0.006-0.006c0.374 0.335 0.678 0.741 0.89 1.198l0.009 0.023c0.2 0.457 0.316 0.989 0.316 1.548 0 0.034-0 0.067-0.001 0.101l0-0.005c0 0.020 0.001 0.044 0.001 0.068 0 0.726-0.2 1.405-0.547 1.985l0.010-0.018zM30.044 29.55v-2.703c1.238 0.949 2.809 1.52 4.513 1.52 0.007 0 0.014 0 0.020-0h-0.001q3.314 0 3.314-2.213c0.001-0.018 0.001-0.040 0.001-0.061 0-0.373-0.106-0.721-0.29-1.015l0.005 0.008c-0.206-0.308-0.46-0.566-0.755-0.77l-0.009-0.006c-0.328-0.227-0.702-0.43-1.097-0.592l-0.040-0.014q-0.654-0.269-1.402-0.561c-0.743-0.291-1.348-0.572-1.934-0.885l0.097 0.047c-0.506-0.264-0.941-0.582-1.323-0.953l0.001 0.001c-0.338-0.334-0.608-0.735-0.791-1.182l-0.009-0.024c-0.171-0.444-0.27-0.957-0.27-1.493 0-0.032 0-0.063 0.001-0.094l-0 0.005c-0-0.020-0.001-0.044-0.001-0.068 0-0.697 0.19-1.349 0.52-1.909l-0.010 0.017c0.347-0.576 0.8-1.054 1.337-1.419l0.016-0.010c0.553-0.376 1.195-0.674 1.884-0.858l0.044-0.010c0.665-0.185 1.428-0.292 2.216-0.292 0.007 0 0.014 0 0.020 0h-0.001c0.045-0.001 0.097-0.001 0.15-0.001 1.266 0 2.472 0.261 3.565 0.731l-0.059-0.022v2.549q-1.737-1.137-3.994-1.137c-0.017-0-0.036-0-0.056-0-0.434 0-0.853 0.059-1.252 0.17l0.033-0.008c-0.372 0.101-0.697 0.257-0.986 0.46l0.010-0.007c-0.26 0.183-0.471 0.417-0.624 0.688l-0.005 0.010c-0.14 0.254-0.223 0.556-0.223 0.878 0 0.007 0 0.014 0 0.021v-0.001c-0.001 0.022-0.001 0.047-0.001 0.073 0 0.349 0.083 0.678 0.23 0.969l-0.006-0.012c0.165 0.296 0.384 0.542 0.646 0.733l0.006 0.004c0.302 0.222 0.646 0.418 1.012 0.572l0.033 0.012q0.614 0.261 1.402 0.568c0.767 0.29 1.385 0.567 1.985 0.873l-0.111-0.051c0.535 0.271 0.995 0.588 1.408 0.957l-0.006-0.005c0.373 0.336 0.676 0.742 0.889 1.198l0.010 0.023c0.2 0.456 0.316 0.988 0.316 1.547 0 0.034-0 0.068-0.001 0.102l0-0.005c0.001 0.031 0.001 0.067 0.001 0.104 0 0.708-0.19 1.371-0.521 1.942l0.010-0.019c-0.351 0.58-0.812 1.058-1.359 1.418l-0.017 0.010c-0.568 0.374-1.23 0.665-1.939 0.836l-0.043 0.009c-0.694 0.176-1.49 0.277-2.31 0.277-0.014 0-0.028-0-0.042-0h0.002q-2.43 0.001-4.212-0.937zM50.924 30.488q-3.488 0-5.57-2.205t-2.081-5.846q0-3.964 2.167-6.191t5.854-2.228q3.518 0 5.493 2.167t1.973 6.007q0 3.765-2.128 6.031t-5.707 2.266zM51.112 16.138q-2.428 0-3.841 1.657t-1.413 4.556q0 2.796 1.429 4.41t3.823 1.613q2.443 0 3.757-1.583t1.314-4.502q0-2.95-1.314-4.547t-3.755-1.605z"></path> </svg>
                                                   </span>
                                                            <span class="text">دخول المستخدمين</span>
                                                        </a>

                                                    </div>

                                                    <div class="private-login"  style="display:none">
                                                        <input type="text" class="form-control" autocomplete="off" placeholder="اسم المستخدم">
                                                        <input type="text" class="form-control" autocomplete="off" placeholder="كلمة المرور">
                                                        <button class="btn btn-primary btn-block" >دخول</button>

                                                    </div>

                                                    <div class="copyright">
                                                        <p> جميع الحقوق محفوظة &copy 2021، الإدارة العامة للحاسوب ونظم المعلومات.</p>
                                                    </div>

                                                </div>

                                            </div>

                                            <div class="back-arrow">
                                                <a href="javascript:;">
                                                </a>
                                            </div>
                                        </div>
                                        <div class="login-left">
                                            <div class="main-image">
                                                <img src="assets/img/aqsa.png" />
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </main>
        </div>
    </div>
</form>
</body>
</html>

<script src="https://code.jquery.com/jquery-3.6.0.min.js" integrity="sha256-/xUj+3OJU5yExlq6GSYGSHk7tPXikynS7ogEvDej/m4=" crossorigin="anonymous"></script>
<script>
    // A $( document ).ready() block.
    $(document).ready(function () {
        $(".back-arrow a").click(function () {
            $(".private-login").css("display", "none");
            $(".actions").css("display", "flex");
            $(".back-arrow").css("display", "none");
        });

        $(".custom-btn.red-bg").click(function () {
            $(".private-login").css("display", "flex");
            $(".actions").css("display", "none");
            $(".back-arrow").css("display", "block");
        });
    });

</script>